#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/yushin-private/aws-mlops/runs/run-Dd8Sfh71VXLkAkfq

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
random_string.suffix: Refreshing state... [id=PvJaEFg9]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-075b2168a8a54d959]
module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Refreshing state... [id=arn:aws:iam::112227029085:policy/mlops-eks-PvJaEFg9-elb-sl-role-creation20210823085950092900000001]
module.eks.aws_iam_role.cluster[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822083332937800000001]
module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822083332937800000001-20210823085950307100000002]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822083332937800000001-20210822083333221900000003]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822083332937800000001-20210822083333228000000004]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822083332937800000001-20210822083333221800000002]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0b18743b4b7302c8f]
aws_security_group.all_worker_mgmt: Refreshing state... [id=sg-034198ad97290fcd6]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-06dff361d9daa34ea]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-02b7b75b8875b6f02]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0386200f19a0ec3c9]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0a134ea213c4bf0e2]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-02d825833703ae3e8]
aws_security_group.worker_group_mgmt_one: Refreshing state... [id=sg-00a9df337c017e67f]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0374fd609632adf7d]
aws_security_group.worker_group_mgmt_two: Refreshing state... [id=sg-081c66a871fd32313]
module.eks.aws_security_group.workers[0]: Refreshing state... [id=sg-00ae5f3b880ec6324]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-06028b53eb644fe96]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0aff3cd4393d112eb]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-073345847327cab44]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-00dd6ad17f28e0110]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02d825833703ae3e81080289494]
module.eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Refreshing state... [id=sgrule-38523699]
module.eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Refreshing state... [id=sgrule-2053659487]
module.eks.aws_security_group_rule.cluster_egress_internet[0]: Refreshing state... [id=sgrule-1933826591]
module.eks.aws_security_group_rule.workers_ingress_cluster[0]: Refreshing state... [id=sgrule-2399265100]
module.eks.aws_security_group_rule.workers_egress_internet[0]: Refreshing state... [id=sgrule-2173523361]
module.eks.aws_security_group_rule.workers_ingress_self[0]: Refreshing state... [id=sgrule-908692302]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ba0c71fe59a51981]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-051a53cf34f3bab1d]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-029613a7fdccb2696]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-05b5a62b36b141900]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-04417febfdd4b1957]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08033d4efa6dd5d4d]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-07bcd2960e6d0ee52]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=mlops-eks-PvJaEFg9]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-06028b53eb644fe961080289494]
module.eks.aws_iam_role.workers[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331718600000007]
module.eks.local_file.kubeconfig[0]: Refreshing state... [id=72b6aec5420a5e3106c781ee27b16610886ac046]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331718600000007-2021082208433202140000000a]
module.eks.aws_iam_instance_profile.workers[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331963400000009]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331718600000007-2021082208433202460000000b]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331718600000007-2021082208433202660000000c]
module.eks.aws_iam_instance_profile.workers[1]: Refreshing state... [id=mlops-eks-PvJaEFg920210822084331955700000008]
module.eks.aws_launch_configuration.workers[1]: Refreshing state... [id=mlops-eks-PvJaEFg9-worker-group-220210823122859004000000002]
module.eks.aws_launch_configuration.workers[0]: Refreshing state... [id=mlops-eks-PvJaEFg9-worker-group-120210823122858997100000001]
module.eks.aws_autoscaling_group.workers[1]: Refreshing state... [id=mlops-eks-PvJaEFg9-worker-group-220210822084347374500000010]
module.eks.aws_autoscaling_group.workers[0]: Refreshing state... [id=mlops-eks-PvJaEFg9-worker-group-12021082208434736930000000f]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "cluster"  {
      ~ arn                       = "arn:aws:eks:ap-southeast-2:112227029085:cluster/mlops-eks-PvJaEFg9" -> (known after apply)
      ~ certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1EZ3lNekV5TWpVeE5sb1hEVE14TURneU1URXlNalV4Tmxvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBS3MyCmFMMzMzbnU2TFg2T2ppY0oycXgvL1VXQXE2dE8zcGlmS0ROYWlFcUJFS3RQSWVQMTJ0NnFNczFxRGFrQmQ0aDAKcUNjVG16WWhIelM1Y0lRTVhxYlFVdkxQTkhhOE9OUVFQL2JVMDRFYzlXL0xoOUNNRkZaejhUeG9tMVgvRkQxUAp0cDA3Y2wxOWExZHcydC9UVHl2eHEzWit6VjRFWnRpSHoxTTdEQjhhS0JCNVhjdDZmaS9aSmN2blhuSEhiN3BrCm5qTEpWZDNtNVNHeXZFcnJVNGMzVjhNU2g3Vmo4QTkySGdteVRZZVRvei9ROFd6bWkyZ2NQQ3pYTzc0d1pmUlIKZVorcWlWVzV2MkE4ZXk4OTlET2RaK1Z2aUZFK2Z5dlpXbVorMXI5ZVBCNUxFdXVlMVJVS3liQW5KSTR5ZUl2eApjZ09IYUtreDYxczVpTHd5SUxzQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZBTzR1LzB6TVNqWkpOTXRlVkFKcWNnYk1QRGlNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFBT1QyZUFhS0Rrb1lqVjM4Z09CK1BZdjF3THNneGJVaXpHZU0xWFpjYjMyTXZzcVl5MApvd1N2TWxMM08xTXZWSXJsbzNOdWxsUkFmZTVtSVNvbzd6QTJITUsxdHNuZXA1eVF2Q2JQRjl6QW5RbGtHenZzCkVQdmNoOEZ2WWdZQjdRL3JSbnhDaEJhaWgxbjBsTkloRFhmUmV4VlRjUnZnTVRhVlVrMGxTUHllV0VuZXNReVEKWTdVWlMzcnpEWVB2bDFxQW1USHM4WjllNWZoMWI3SFJoUXh2djBCWmFXTEp1RzF4S242eEt0WGJ3OVVmWlJiNwoxZzhLUC9PNlYzTDdoTjh4WG5KbXNzL2dlSUNJdTQwQlRtb3dGb2VvWU5ENUFUS25yTGtCK08ybWc1K3lkbXd0Cm5ISUs5WnFDSDJnQUFjQ2phcWdIT0V2M0dWTkw2dHpOUGgzbAotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
            },
        ] -> (known after apply)
      ~ created_at                = "2021-08-23 12:19:33.56 +0000 UTC" -> (known after apply)
      ~ enabled_cluster_log_types = [] -> (known after apply)
      ~ endpoint                  = "https://CE3583899C832AFC06E1D0A726FC157E.sk1.ap-southeast-2.eks.amazonaws.com" -> (known after apply)
      ~ id                        = "mlops-eks-PvJaEFg9" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.ap-southeast-2.amazonaws.com/id/CE3583899C832AFC06E1D0A726FC157E"
                    },
                ]
            },
        ] -> (known after apply)
      ~ kubernetes_network_config = [
          - {
              - service_ipv4_cidr = "172.20.0.0/16"
            },
        ] -> (known after apply)
      ~ name                      = "mlops-eks-PvJaEFg9" -> (known after apply)
      ~ platform_version          = "eks.2" -> (known after apply)
      ~ role_arn                  = "arn:aws:iam::112227029085:role/mlops-eks-PvJaEFg920210822083332937800000001" -> (known after apply)
      ~ status                    = "ACTIVE" -> (known after apply)
      ~ tags                      = {
          - "Environment" = "training"
        } -> (known after apply)
      ~ version                   = "1.20" -> (known after apply)
      ~ vpc_config                = [
          - {
              - cluster_security_group_id = "sg-0b0c8e9492bf4c54f"
              - endpoint_private_access   = false
              - endpoint_public_access    = true
              - public_access_cidrs       = [
                  - "0.0.0.0/0",
                ]
              - security_group_ids        = [
                  - "sg-0386200f19a0ec3c9",
                ]
              - subnet_ids                = [
                  - "subnet-00dd6ad17f28e0110",
                  - "subnet-02b7b75b8875b6f02",
                  - "subnet-06dff361d9daa34ea",
                  - "subnet-073345847327cab44",
                  - "subnet-0a134ea213c4bf0e2",
                  - "subnet-0aff3cd4393d112eb",
                ]
              - vpc_id                    = "vpc-075b2168a8a54d959"
            },
        ] -> (known after apply)
    }

  # data.aws_eks_cluster_auth.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "cluster"  {
      ~ id    = "mlops-eks-PvJaEFg9" -> (known after apply)
      ~ name  = "mlops-eks-PvJaEFg9" -> (known after apply)
      ~ token = (sensitive value)
    }

  # module.eks.data.http.wait_for_cluster[0] will be read during apply
  # (config refers to values not yet known)
 <= data "http" "wait_for_cluster"  {
      ~ body             = "ok" -> (known after apply)
      ~ ca_certificate   = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIC5zCCAc+gAwIBAgIBADANBgkqhkiG9w0BAQsFADAVMRMwEQYDVQQDEwprdWJl
            cm5ldGVzMB4XDTIxMDgyMzEyMjUxNloXDTMxMDgyMTEyMjUxNlowFTETMBEGA1UE
            AxMKa3ViZXJuZXRlczCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBAKs2
            aL333nu6LX6OjicJ2qx//UWAq6tO3pifKDNaiEqBEKtPIeP12t6qMs1qDakBd4h0
            qCcTmzYhHzS5cIQMXqbQUvLPNHa8ONQQP/bU04Ec9W/Lh9CMFFZz8Txom1X/FD1P
            tp07cl19a1dw2t/TTyvxq3Z+zV4EZtiHz1M7DB8aKBB5Xct6fi/ZJcvnXnHHb7pk
            njLJVd3m5SGyvErrU4c3V8MSh7Vj8A92HgmyTYeToz/Q8Wzmi2gcPCzXO74wZfRR
            eZ+qiVW5v2A8ey899DOdZ+VviFE+fyvZWmZ+1r9ePB5LEuue1RUKybAnJI4yeIvx
            cgOHaKkx61s5iLwyILsCAwEAAaNCMEAwDgYDVR0PAQH/BAQDAgKkMA8GA1UdEwEB
            /wQFMAMBAf8wHQYDVR0OBBYEFAO4u/0zMSjZJNMteVAJqcgbMPDiMA0GCSqGSIb3
            DQEBCwUAA4IBAQAOT2eAaKDkoYjV38gOB+PYv1wLsgxbUizGeM1XZcb32MvsqYy0
            owSvMlL3O1MvVIrlo3NullRAfe5mISoo7zA2HMK1tsnep5yQvCbPF9zAnQlkGzvs
            EPvch8FvYgYB7Q/rRnxChBaih1n0lNIhDXfRexVTcRvgMTaVUk0lSPyeWEnesQyQ
            Y7UZS3rzDYPvl1qAmTHs8Z9e5fh1b7HRhQxvv0BZaWLJuG1xKn6xKtXbw9UfZRb7
            1g8KP/O6V3L7hN8xXnJmss/geICIu40BTmowFoeoYND5ATKnrLkB+O2mg5+ydmwt
            nHIK9ZqCH2gAAcCjaqgHOEv3GVNL6tzNPh3l
            -----END CERTIFICATE-----
        EOT -> (known after apply)
      ~ id               = "https://CE3583899C832AFC06E1D0A726FC157E.sk1.ap-southeast-2.eks.amazonaws.com/healthz" -> (known after apply)
      - insecure         = false -> null
      ~ response_headers = {
          - "Cache-Control"                     = "no-cache, private"
          - "Content-Length"                    = "2"
          - "Content-Type"                      = "text/plain; charset=utf-8"
          - "Date"                              = "Mon, 23 Aug 2021 12:31:18 GMT"
          - "X-Content-Type-Options"            = "nosniff"
          - "X-Kubernetes-Pf-Flowschema-Uid"    = "9fb8e918-84b1-4c75-bf62-c3dda03c72b5"
          - "X-Kubernetes-Pf-Prioritylevel-Uid" = "aca631f7-591f-41c5-9c4e-a0b7f6a68819"
        } -> (known after apply)
      ~ url              = "https://CE3583899C832AFC06E1D0A726FC157E.sk1.ap-southeast-2.eks.amazonaws.com/healthz" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_autoscaling_group.workers[0] will be updated in-place
  ~ resource "aws_autoscaling_group" "workers" {
        id                        = "mlops-eks-PvJaEFg9-worker-group-12021082208434736930000000f"
      ~ launch_configuration      = "mlops-eks-PvJaEFg9-worker-group-120210823122858997100000001" -> (known after apply)
        name                      = "mlops-eks-PvJaEFg9-worker-group-12021082208434736930000000f"
        # (23 unchanged attributes hidden)

      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "test"
        }
      - tag {
          - key                 = "Environment" -> null
          - propagate_at_launch = true -> null
          - value               = "training" -> null
        }
        # (3 unchanged blocks hidden)
    }

  # module.eks.aws_autoscaling_group.workers[1] will be updated in-place
  ~ resource "aws_autoscaling_group" "workers" {
        id                        = "mlops-eks-PvJaEFg9-worker-group-220210822084347374500000010"
      ~ launch_configuration      = "mlops-eks-PvJaEFg9-worker-group-220210823122859004000000002" -> (known after apply)
        name                      = "mlops-eks-PvJaEFg9-worker-group-220210822084347374500000010"
        # (23 unchanged attributes hidden)

      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "test"
        }
      - tag {
          - key                 = "Environment" -> null
          - propagate_at_launch = true -> null
          - value               = "training" -> null
        }
        # (3 unchanged blocks hidden)
    }

  # module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "mlops-eks-PvJaEFg9"
      + platform_version      = (known after apply)
      + role_arn              = "arn:aws:iam::112227029085:role/mlops-eks-PvJaEFg920210822083332937800000001"
      + status                = (known after apply)
      + tags                  = {
          + "Environment" = "test"
        }
      + tags_all              = {
          + "Environment" = "test"
        }
      + version               = "1.20"

      + kubernetes_network_config {
          + service_ipv4_cidr = (known after apply)
        }

      + timeouts {
          + create = "30m"
          + delete = "15m"
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = [
              + "sg-0386200f19a0ec3c9",
            ]
          + subnet_ids                = [
              + "subnet-00dd6ad17f28e0110",
              + "subnet-02b7b75b8875b6f02",
              + "subnet-06dff361d9daa34ea",
              + "subnet-073345847327cab44",
              + "subnet-0a134ea213c4bf0e2",
              + "subnet-0aff3cd4393d112eb",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_instance_profile.workers[0] will be updated in-place
  ~ resource "aws_iam_instance_profile" "workers" {
        id          = "mlops-eks-PvJaEFg920210822084331963400000009"
        name        = "mlops-eks-PvJaEFg920210822084331963400000009"
      ~ tags        = {
          ~ "Environment" = "training" -> "test"
        }
      ~ tags_all    = {
          ~ "Environment" = "training" -> "test"
        }
        # (6 unchanged attributes hidden)
    }

  # module.eks.aws_iam_instance_profile.workers[1] will be updated in-place
  ~ resource "aws_iam_instance_profile" "workers" {
        id          = "mlops-eks-PvJaEFg920210822084331955700000008"
        name        = "mlops-eks-PvJaEFg920210822084331955700000008"
      ~ tags        = {
          ~ "Environment" = "training" -> "test"
        }
      ~ tags_all    = {
          ~ "Environment" = "training" -> "test"
        }
        # (6 unchanged attributes hidden)
    }

  # module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0] will be updated in-place
  ~ resource "aws_iam_policy" "cluster_elb_sl_role_creation" {
        id          = "arn:aws:iam::112227029085:policy/mlops-eks-PvJaEFg9-elb-sl-role-creation20210823085950092900000001"
        name        = "mlops-eks-PvJaEFg9-elb-sl-role-creation20210823085950092900000001"
      ~ tags        = {
          ~ "Environment" = "training" -> "test"
        }
      ~ tags_all    = {
          ~ "Environment" = "training" -> "test"
        }
        # (6 unchanged attributes hidden)
    }

  # module.eks.aws_iam_role.cluster[0] will be updated in-place
  ~ resource "aws_iam_role" "cluster" {
        id                    = "mlops-eks-PvJaEFg920210822083332937800000001"
        name                  = "mlops-eks-PvJaEFg920210822083332937800000001"
      ~ tags                  = {
          ~ "Environment" = "training" -> "test"
        }
      ~ tags_all              = {
          ~ "Environment" = "training" -> "test"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.aws_iam_role.workers[0] will be updated in-place
  ~ resource "aws_iam_role" "workers" {
        id                    = "mlops-eks-PvJaEFg920210822084331718600000007"
        name                  = "mlops-eks-PvJaEFg920210822084331718600000007"
      ~ tags                  = {
          ~ "Environment" = "training" -> "test"
        }
      ~ tags_all              = {
          ~ "Environment" = "training" -> "test"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.aws_launch_configuration.workers[0] must be replaced
+/- resource "aws_launch_configuration" "workers" {
      ~ arn                              = "arn:aws:autoscaling:ap-southeast-2:112227029085:launchConfiguration:6762cca1-d7a1-42fd-8a46-706b3a9ed9fe:launchConfigurationName/mlops-eks-PvJaEFg9-worker-group-120210823122858997100000001" -> (known after apply)
      ~ id                               = "mlops-eks-PvJaEFg9-worker-group-120210823122858997100000001" -> (known after apply)
      ~ name                             = "mlops-eks-PvJaEFg9-worker-group-120210823122858997100000001" -> (known after apply)
      ~ user_data_base64                 = "IyEvYmluL2Jhc2ggLWUKCiMgQWxsb3cgdXNlciBzdXBwbGllZCBwcmUgdXNlcmRhdGEgY29kZQoKCiMgQm9vdHN0cmFwIGFuZCBqb2luIHRoZSBjbHVzdGVyCi9ldGMvZWtzL2Jvb3RzdHJhcC5zaCAtLWI2NC1jbHVzdGVyLWNhICdMUzB0TFMxQ1JVZEpUaUJEUlZKVVNVWkpRMEZVUlMwdExTMHRDazFKU1VNMWVrTkRRV01yWjBGM1NVSkJaMGxDUVVSQlRrSm5hM0ZvYTJsSE9YY3dRa0ZSYzBaQlJFRldUVkpOZDBWUldVUldVVkZFUlhkd2NtUlhTbXdLWTIwMWJHUkhWbnBOUWpSWVJGUkplRTFFWjNsTmVrVjVUV3BWZUU1c2IxaEVWRTE0VFVSbmVVMVVSWGxOYWxWNFRteHZkMFpVUlZSTlFrVkhRVEZWUlFwQmVFMUxZVE5XYVZwWVNuVmFXRkpzWTNwRFEwRlRTWGRFVVZsS1MyOWFTV2gyWTA1QlVVVkNRbEZCUkdkblJWQkJSRU5EUVZGdlEyZG5SVUpCUzNNeUNtRk1Nek16Ym5VMlRGZzJUMnBwWTBveWNYZ3ZMMVZYUVhFMmRFOHpjR2xtUzBST1lXbEZjVUpGUzNSUVNXVlFNVEowTm5GTmN6RnhSR0ZyUW1RMGFEQUtjVU5qVkcxNldXaEllbE0xWTBsUlRWaHhZbEZWZGt4UVRraGhPRTlPVVZGUUwySlZNRFJGWXpsWEwweG9PVU5OUmtaYWVqaFVlRzl0TVZndlJrUXhVQXAwY0RBM1kyd3hPV0V4WkhjeWRDOVVWSGwyZUhFeldpdDZWalJGV25ScFNIb3hUVGRFUWpoaFMwSkNOVmhqZERabWFTOWFTbU4yYmxodVNFaGlOM0JyQ201cVRFcFdaRE50TlZOSGVYWkZjbkpWTkdNelZqaE5VMmczVm1vNFFUa3lTR2R0ZVZSWlpWUnZlaTlST0ZkNmJXa3laMk5RUTNwWVR6YzBkMXBtVWxJS1pWb3JjV2xXVnpWMk1rRTRaWGs0T1RsRVQyUmFLMVoyYVVaRksyWjVkbHBYYlZvck1YSTVaVkJDTlV4RmRYVmxNVkpWUzNsaVFXNUtTVFI1WlVsMmVBcGpaMDlJWVV0cmVEWXhjelZwVEhkNVNVeHpRMEYzUlVGQllVNURUVVZCZDBSbldVUldVakJRUVZGSUwwSkJVVVJCWjB0clRVRTRSMEV4VldSRmQwVkNDaTkzVVVaTlFVMUNRV1k0ZDBoUldVUldVakJQUWtKWlJVWkJUelIxTHpCNlRWTnFXa3BPVFhSbFZrRktjV05uWWsxUVJHbE5RVEJIUTFOeFIxTkpZak1LUkZGRlFrTjNWVUZCTkVsQ1FWRkJUMVF5WlVGaFMwUnJiMWxxVmpNNFowOUNLMUJaZGpGM1RITm5lR0pWYVhwSFpVMHhXRnBqWWpNeVRYWnpjVmw1TUFwdmQxTjJUV3hNTTA4eFRYWldTWEpzYnpOT2RXeHNVa0ZtWlRWdFNWTnZiemQ2UVRKSVRVc3hkSE51WlhBMWVWRjJRMkpRUmpsNlFXNVJiR3RIZW5aekNrVlFkbU5vT0VaMldXZFpRamRSTDNKU2JuaERhRUpoYVdneGJqQnNUa2xvUkZobVVtVjRWbFJqVW5ablRWUmhWbFZyTUd4VFVIbGxWMFZ1WlhOUmVWRUtXVGRWV2xNemNucEVXVkIyYkRGeFFXMVVTSE00V2psbE5XWm9NV0kzU0ZKb1VYaDJkakJDV21GWFRFcDFSekY0UzI0MmVFdDBXR0ozT1ZWbVdsSmlOd294WnpoTFVDOVBObFl6VERkb1RqaDRXRzVLYlhOekwyZGxTVU5KZFRRd1FsUnRiM2RHYjJWdldVNUVOVUZVUzI1eVRHdENLMDh5YldjMUszbGtiWGQwQ201SVNVczVXbkZEU0RKblFVRmpRMnBoY1dkSVQwVjJNMGRXVGt3MmRIcE9VR2d6YkFvdExTMHRMVVZPUkNCRFJWSlVTVVpKUTBGVVJTMHRMUzB0Q2c9PScgLS1hcGlzZXJ2ZXItZW5kcG9pbnQgJ2h0dHBzOi8vQ0UzNTgzODk5QzgzMkFGQzA2RTFEMEE3MjZGQzE1N0Uuc2sxLmFwLXNvdXRoZWFzdC0yLmVrcy5hbWF6b25hd3MuY29tJyAgLS1rdWJlbGV0LWV4dHJhLWFyZ3MgIiIgJ21sb3BzLWVrcy1QdkphRUZnOScKCiMgQWxsb3cgdXNlciBzdXBwbGllZCB1c2VyZGF0YSBjb2RlCmVjaG8gZm9vIGJhcgo=" -> (known after apply) # forces replacement
      - vpc_classic_link_security_groups = [] -> null
        # (9 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ metadata_options {
          ~ http_put_response_hop_limit = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ root_block_device {
          ~ throughput            = 0 -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.eks.aws_launch_configuration.workers[1] must be replaced
+/- resource "aws_launch_configuration" "workers" {
      ~ arn                              = "arn:aws:autoscaling:ap-southeast-2:112227029085:launchConfiguration:e364b3dd-ab90-44c7-bb94-b9581a8c0816:launchConfigurationName/mlops-eks-PvJaEFg9-worker-group-220210823122859004000000002" -> (known after apply)
      ~ id                               = "mlops-eks-PvJaEFg9-worker-group-220210823122859004000000002" -> (known after apply)
      ~ name                             = "mlops-eks-PvJaEFg9-worker-group-220210823122859004000000002" -> (known after apply)
      ~ user_data_base64                 = "IyEvYmluL2Jhc2ggLWUKCiMgQWxsb3cgdXNlciBzdXBwbGllZCBwcmUgdXNlcmRhdGEgY29kZQoKCiMgQm9vdHN0cmFwIGFuZCBqb2luIHRoZSBjbHVzdGVyCi9ldGMvZWtzL2Jvb3RzdHJhcC5zaCAtLWI2NC1jbHVzdGVyLWNhICdMUzB0TFMxQ1JVZEpUaUJEUlZKVVNVWkpRMEZVUlMwdExTMHRDazFKU1VNMWVrTkRRV01yWjBGM1NVSkJaMGxDUVVSQlRrSm5hM0ZvYTJsSE9YY3dRa0ZSYzBaQlJFRldUVkpOZDBWUldVUldVVkZFUlhkd2NtUlhTbXdLWTIwMWJHUkhWbnBOUWpSWVJGUkplRTFFWjNsTmVrVjVUV3BWZUU1c2IxaEVWRTE0VFVSbmVVMVVSWGxOYWxWNFRteHZkMFpVUlZSTlFrVkhRVEZWUlFwQmVFMUxZVE5XYVZwWVNuVmFXRkpzWTNwRFEwRlRTWGRFVVZsS1MyOWFTV2gyWTA1QlVVVkNRbEZCUkdkblJWQkJSRU5EUVZGdlEyZG5SVUpCUzNNeUNtRk1Nek16Ym5VMlRGZzJUMnBwWTBveWNYZ3ZMMVZYUVhFMmRFOHpjR2xtUzBST1lXbEZjVUpGUzNSUVNXVlFNVEowTm5GTmN6RnhSR0ZyUW1RMGFEQUtjVU5qVkcxNldXaEllbE0xWTBsUlRWaHhZbEZWZGt4UVRraGhPRTlPVVZGUUwySlZNRFJGWXpsWEwweG9PVU5OUmtaYWVqaFVlRzl0TVZndlJrUXhVQXAwY0RBM1kyd3hPV0V4WkhjeWRDOVVWSGwyZUhFeldpdDZWalJGV25ScFNIb3hUVGRFUWpoaFMwSkNOVmhqZERabWFTOWFTbU4yYmxodVNFaGlOM0JyQ201cVRFcFdaRE50TlZOSGVYWkZjbkpWTkdNelZqaE5VMmczVm1vNFFUa3lTR2R0ZVZSWlpWUnZlaTlST0ZkNmJXa3laMk5RUTNwWVR6YzBkMXBtVWxJS1pWb3JjV2xXVnpWMk1rRTRaWGs0T1RsRVQyUmFLMVoyYVVaRksyWjVkbHBYYlZvck1YSTVaVkJDTlV4RmRYVmxNVkpWUzNsaVFXNUtTVFI1WlVsMmVBcGpaMDlJWVV0cmVEWXhjelZwVEhkNVNVeHpRMEYzUlVGQllVNURUVVZCZDBSbldVUldVakJRUVZGSUwwSkJVVVJCWjB0clRVRTRSMEV4VldSRmQwVkNDaTkzVVVaTlFVMUNRV1k0ZDBoUldVUldVakJQUWtKWlJVWkJUelIxTHpCNlRWTnFXa3BPVFhSbFZrRktjV05uWWsxUVJHbE5RVEJIUTFOeFIxTkpZak1LUkZGRlFrTjNWVUZCTkVsQ1FWRkJUMVF5WlVGaFMwUnJiMWxxVmpNNFowOUNLMUJaZGpGM1RITm5lR0pWYVhwSFpVMHhXRnBqWWpNeVRYWnpjVmw1TUFwdmQxTjJUV3hNTTA4eFRYWldTWEpzYnpOT2RXeHNVa0ZtWlRWdFNWTnZiemQ2UVRKSVRVc3hkSE51WlhBMWVWRjJRMkpRUmpsNlFXNVJiR3RIZW5aekNrVlFkbU5vT0VaMldXZFpRamRSTDNKU2JuaERhRUpoYVdneGJqQnNUa2xvUkZobVVtVjRWbFJqVW5ablRWUmhWbFZyTUd4VFVIbGxWMFZ1WlhOUmVWRUtXVGRWV2xNemNucEVXVkIyYkRGeFFXMVVTSE00V2psbE5XWm9NV0kzU0ZKb1VYaDJkakJDV21GWFRFcDFSekY0UzI0MmVFdDBXR0ozT1ZWbVdsSmlOd294WnpoTFVDOVBObFl6VERkb1RqaDRXRzVLYlhOekwyZGxTVU5KZFRRd1FsUnRiM2RHYjJWdldVNUVOVUZVUzI1eVRHdENLMDh5YldjMUszbGtiWGQwQ201SVNVczVXbkZEU0RKblFVRmpRMnBoY1dkSVQwVjJNMGRXVGt3MmRIcE9VR2d6YkFvdExTMHRMVVZPUkNCRFJWSlVTVVpKUTBGVVJTMHRMUzB0Q2c9PScgLS1hcGlzZXJ2ZXItZW5kcG9pbnQgJ2h0dHBzOi8vQ0UzNTgzODk5QzgzMkFGQzA2RTFEMEE3MjZGQzE1N0Uuc2sxLmFwLXNvdXRoZWFzdC0yLmVrcy5hbWF6b25hd3MuY29tJyAgLS1rdWJlbGV0LWV4dHJhLWFyZ3MgIiIgJ21sb3BzLWVrcy1QdkphRUZnOScKCiMgQWxsb3cgdXNlciBzdXBwbGllZCB1c2VyZGF0YSBjb2RlCmVjaG8gZm9vIGJhcgo=" -> (known after apply) # forces replacement
      - vpc_classic_link_security_groups = [] -> null
        # (9 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ metadata_options {
          ~ http_put_response_hop_limit = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ root_block_device {
          ~ throughput            = 0 -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.eks.aws_security_group.cluster[0] will be updated in-place
  ~ resource "aws_security_group" "cluster" {
        id                     = "sg-0386200f19a0ec3c9"
        name                   = "mlops-eks-PvJaEFg920210822083342191500000006"
      ~ tags                   = {
          ~ "Environment" = "training" -> "test"
            # (1 unchanged element hidden)
        }
      ~ tags_all               = {
          ~ "Environment" = "training" -> "test"
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.eks.aws_security_group.workers[0] will be updated in-place
  ~ resource "aws_security_group" "workers" {
        id                     = "sg-00ae5f3b880ec6324"
        name                   = "mlops-eks-PvJaEFg920210822083342163300000005"
      ~ tags                   = {
          ~ "Environment"                              = "training" -> "test"
            # (2 unchanged elements hidden)
        }
      ~ tags_all               = {
          ~ "Environment"                              = "training" -> "test"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.eks.kubernetes_config_map.aws_auth[0] will be created
  + resource "kubernetes_config_map" "aws_auth" {
      + data = {
          + "mapAccounts" = jsonencode([])
          + "mapRoles"    = <<-EOT
                - "groups":
                  - "system:bootstrappers"
                  - "system:nodes"
                  "rolearn": "arn:aws:iam::112227029085:role/mlops-eks-PvJaEFg920210822084331718600000007"
                  "username": "system:node:{{EC2PrivateDNSName}}"
            EOT
          + "mapUsers"    = jsonencode([])
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/managed-by" = "Terraform"
              + "terraform.io/module"          = "terraform-aws-modules.eks.aws"
            }
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0600"
      + filename             = "./kubeconfig_mlops-eks-PvJaEFg9"
      + id                   = (known after apply)
    }

Plan: 5 to add, 9 to change, 2 to destroy.

Changes to Outputs:
  ~ cluster_endpoint    = "https://CE3583899C832AFC06E1D0A726FC157E.sk1.ap-southeast-2.eks.amazonaws.com" -> (known after apply)
  ~ cluster_id          = "mlops-eks-PvJaEFg9" -> (known after apply)
  ~ config_map_aws_auth = [
      ~ {
          ~ binary_data = {} -> null
          ~ id          = "kube-system/aws-auth" -> (known after apply)
          ~ metadata    = [
              ~ {
                  ~ annotations      = {} -> null
                  ~ generate_name    = "" -> null
                  ~ generation       = 0 -> (known after apply)
                  ~ resource_version = "579" -> (known after apply)
                  ~ uid              = "674b2080-e80b-4ce7-be27-185e0446f8d6" -> (known after apply)
                    # (3 unchanged elements hidden)
                },
            ]
            # (1 unchanged element hidden)
        },
    ]
  ~ kubectl_config      = <<-EOT
        apiVersion: v1
        preferences: {}
        kind: Config
        
        clusters:
        - cluster:
            server: https://CE3583899C832AFC06E1D0A726FC157E.sk1.ap-southeast-2.eks.amazonaws.com
            certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeE1EZ3lNekV5TWpVeE5sb1hEVE14TURneU1URXlNalV4Tmxvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBS3MyCmFMMzMzbnU2TFg2T2ppY0oycXgvL1VXQXE2dE8zcGlmS0ROYWlFcUJFS3RQSWVQMTJ0NnFNczFxRGFrQmQ0aDAKcUNjVG16WWhIelM1Y0lRTVhxYlFVdkxQTkhhOE9OUVFQL2JVMDRFYzlXL0xoOUNNRkZaejhUeG9tMVgvRkQxUAp0cDA3Y2wxOWExZHcydC9UVHl2eHEzWit6VjRFWnRpSHoxTTdEQjhhS0JCNVhjdDZmaS9aSmN2blhuSEhiN3BrCm5qTEpWZDNtNVNHeXZFcnJVNGMzVjhNU2g3Vmo4QTkySGdteVRZZVRvei9ROFd6bWkyZ2NQQ3pYTzc0d1pmUlIKZVorcWlWVzV2MkE4ZXk4OTlET2RaK1Z2aUZFK2Z5dlpXbVorMXI5ZVBCNUxFdXVlMVJVS3liQW5KSTR5ZUl2eApjZ09IYUtreDYxczVpTHd5SUxzQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZBTzR1LzB6TVNqWkpOTXRlVkFKcWNnYk1QRGlNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFBT1QyZUFhS0Rrb1lqVjM4Z09CK1BZdjF3THNneGJVaXpHZU0xWFpjYjMyTXZzcVl5MApvd1N2TWxMM08xTXZWSXJsbzNOdWxsUkFmZTVtSVNvbzd6QTJITUsxdHNuZXA1eVF2Q2JQRjl6QW5RbGtHenZzCkVQdmNoOEZ2WWdZQjdRL3JSbnhDaEJhaWgxbjBsTkloRFhmUmV4VlRjUnZnTVRhVlVrMGxTUHllV0VuZXNReVEKWTdVWlMzcnpEWVB2bDFxQW1USHM4WjllNWZoMWI3SFJoUXh2djBCWmFXTEp1RzF4S242eEt0WGJ3OVVmWlJiNwoxZzhLUC9PNlYzTDdoTjh4WG5KbXNzL2dlSUNJdTQwQlRtb3dGb2VvWU5ENUFUS25yTGtCK08ybWc1K3lkbXd0Cm5ISUs5WnFDSDJnQUFjQ2phcWdIT0V2M0dWTkw2dHpOUGgzbAotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
          name: eks_mlops-eks-PvJaEFg9
        
        contexts:
        - context:
            cluster: eks_mlops-eks-PvJaEFg9
            user: eks_mlops-eks-PvJaEFg9
          name: eks_mlops-eks-PvJaEFg9
        
        current-context: eks_mlops-eks-PvJaEFg9
        
        users:
        - name: eks_mlops-eks-PvJaEFg9
          user:
            exec:
              apiVersion: client.authentication.k8s.io/v1alpha1
              command: aws-iam-authenticator
              args:
                - "token"
                - "-i"
                - "mlops-eks-PvJaEFg9"
    EOT -> (known after apply)

```
</details>
*Pusher: @yushindkang, Action: `pull_request`*